Tekla.Structures.Model.SpiralBeamDataException
The SpiralBeamDataException class represents an error that occurred during the spiral beam creation or modification.

Tekla.Structures.Model.SpiralBeamDataException.ErrorStatus
Contains error status during spiral beam creation/modification.

Tekla.Structures.Model.SpiralBeamDataException.#ctor(Tekla.Structures.Model.SpiralBeam.ErrorStatus,System.String)
Initializes a new instance of the SpiralBeamDataException class with spiral beam error message based on status.
status:
message: